---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeFrontNosing
source: html/4c566caf-8cf9-defc-1167-93dce06d4a45.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeFrontNosing Property

"Front Nosing": (OBSOLETE)

## Syntax (C#)
```csharp
public static ForgeTypeId StairsTrisertypeFrontNosing { get; }
```